lectures/annexe_variable_statique.org
#+TITLE:  Les membres données statiques
#+AUTHOR: Xavier Garrido
#+DATE:   05/10/2013
#+OPTIONS: toc:nil ^:{}
#+LATEX_CLASS: lecture
#+LATEX_CLASS_OPTIONS: [10pt,a4paper,twoside,cpp_teaching_lectures]
#+LATEX_HEADER: \setcounter{chapter}{3}
#+LATEX_HEADER: \renewcommand{\chaptername}{annexe}

Les différentes instances d'une classe ont toutes les mêmes méthodes. Mais
chaque instance à ses propres membres. Un membre statique et justement un
*membre qui est le même*, /i.e./ qui est dans le même espace mémoire, pour toutes
les instances de la classe.

* Syntaxe

La déclaration d'un membre statique est préfixée par l'instruction =static=. Le
membre doit, par ailleurs, être initialisé explicitement à l'exterieur de la
déclaration de la classe.
#+BEGIN_SRC c++
  // Déclaration
  class nom_classe
  {
    static int nom_variable_statique;   [...]
  };
  // Initialisation
  int nom_classe::nom_variable_statique = valeur_initiale;
#+END_SRC


* Utilisation

Lorsque différentes instances, différents objets, de la classe doivent partager
une donnée en commun (comme par exemple le nombre d'objet créé depuis le début
du programme) on utilise un membre statique.
