doc/lectures/annexe_variable_statique.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Les membres données statiques</title>
<!-- 2013-10-19 sam. 16:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="lecture_pointeur.html">Pointeurs, références & allocation dynamique </a><a href="lecture_fonction.html">Rappels sur les fonctions </a><a href="lecture_specificite_c++.html">Les spécificités du C++ </a><a href="lecture_struct_class.html">Structures et classes </a><aa>Encapsulation des données </aa><aa>Notions de constructeur et de destructeur </aa><aa>Fonctions et classes amies </aa><aa>Surcharge d'opérateur </aa><aa>Héritage </aa><aa>Notions de patrons de fonctions et de classes </aa><aa>Introduction à la librairie standard STL </aa><a href=""></a><hr/><a href="annexe_compilation.html">Compilation et directives de préprocesseur </a><a href="annexe_convention_ecriture.html">Convention d'écriture et organisation des programmes </a><a href="annexe_cout_cin.html">Écriture/lecture sur l'entrée/sortie standard </a><aa>Les membres données statiques </aa><aa>Utilisation de enum et de typedef </aa>
                    <hr/>
                    <a href="../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Les membres données statiques</h1><hr/>
<p>
Les différentes instances d&rsquo;une classe ont toutes les mêmes méthodes. Mais
chaque instance à ses propres membres. Un membre statique et justement un
<b>membre qui est le même</b>, <i>i.e.</i> qui est dans le même espace mémoire, pour toutes
les instances de la classe.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Syntaxe</h2>
<div class="outline-text-2" id="text-1">
<p>
La déclaration d&rsquo;un membre statique est préfixée par l&rsquo;instruction <code>static</code>. Le
membre doit, par ailleurs, être initialisé explicitement à l&rsquo;exterieur de la
déclaration de la classe.
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;claration</span>
<span class="org-keyword">class</span> <span class="org-type">nom_classe</span>
{
  <span class="org-keyword">static</span> <span class="org-type">int</span> <span class="org-variable-name">nom_variable_statique</span>;   [...]
};
<span class="org-comment-delimiter">// </span><span class="org-comment">Initialisation</span>
<span class="org-type">int</span> <span class="org-constant">nom_classe</span>::<span class="org-variable-name">nom_variable_statique</span> = valeur_initiale;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Utilisation</h2>
<div class="outline-text-2" id="text-2">
<p>
Lorsque différentes instances, différents objets, de la classe doivent partager
une donnée en commun (comme par exemple le nombre d&rsquo;objet créé depuis le début
du programme) on utilise un membre statique.
</p>
</div>
</div>
</div>
</body>
</html>
